import os
import sqlite3

from xlrd import open_workbook


def getTable(xl):
    sheets = xl.sheets()
    sheetDir = {}
    for sheet in sheets:
        sheetDir[sheet.name] = sheet.col_values(0)
    print(2)
    print(sheetDir)
    return sheetDir


def setDatabase(sheetDir: dir):
    try:
        conn = sqlite3.connect('Words.db')
        cur = conn.cursor()
        wordListName = []
        for key, value in sheetDir.items():
            wordListName.append(key)
            sql = 'create table ' + str(key) + ' (words text)'
            cur.execute(sql)
            for i in value:
                sql = 'insert into ' + str(key) + '(words) values(\'' + str(i) + '\')'
                cur.execute(sql)
        sql = 'create table wordsList (words text)'
        cur.execute(sql)
        for i in wordListName:
            sql = 'insert into wordsList(words) values(\'' + str(i) + '\')'
            cur.execute(sql)
        conn.commit()
        conn.close()
    except:
        print('数据库无法打开')


def createDatabaseInit(url):
    print(url)
    xl = open_workbook(url)
    print('打开成功')
    os.remove('Words.db')
    print('Words.db 已删除')
    print(1)
    sheetDir = getTable(xl)
    setDatabase(sheetDir)
    return


def createOriginDatabase():
    os.remove('Words.db')
    conn = sqlite3.connect('Words.db')
    cur = conn.cursor()
    jsonDataOrigin = {
        "data": [
            {
                "name": "褒贬不当",
                "words": [
                    "拭目以待", "神机妙算", "名不虚传", "凤毛麟角", "洋洋大观",
                    "沁人心脾", "别有天地", "别出心杼", "有口无心", "惨淡经营",
                    "来日方长", "满城风雨", "形形色色", "无独有偶", "无所不为",
                    "长此以往", "趋之若鹜", "半斤八两", "等量齐观", "绞尽心机",
                    "大言不惭", "明目张胆", "明哲保身", "忘乎所以", "高谈阔论",
                    "始作俑者", "好高骛远", "邯郸学步", "如丧考妣", "一丘之貉",
                    "咄咄逼人", "虎视眈眈", "别有用心", "衣冠楚楚", "巧言令色",
                    "好为人师", "人模人样", "神气活现", "趾高气扬", "为所欲为",
                    "呜呼哀哉", "天花乱坠", "巧舌如簧", "一团和气", "改头换面"
                ]
            },
            {
                "name": "词义相近",
                "words": [
                    "惨无人道", "趁火打劫", "心满意足", "承前启后", "三五成群",
                    "惨绝人寰", "浑水摸鱼", "称心如意", "承上启下", "成群结队",
                    "胡思乱想", "痴心妄想", "重整旗鼓", "卷土重来", "呕心沥血",
                    "处心积虑", "粗心大意", "粗枝大叶", "大张旗鼓", "雷厉风行",
                    "当仁不让", "义不容辞", "道貌岸然", "一本正经", "一视同仁",
                    "等量齐观", "牢不可破", "颠扑不破", "死灰复燃", "东山再起",
                    "洞若观火", "了如指掌", "标新立异", "独树一帜", "耳濡目染",
                    "耳闻目睹", "翻天覆地", "天翻地覆", "翻云覆雨", "朝三暮四",
                    "朝秦暮楚", "烟消云散", "风流云散", "风平浪静", "一帆风顺",
                    "风雨飘摇", "摇摇欲坠", "浮光掠影", "走马观花", "后来居上",
                    "青出于蓝", "生吞活剥", "囫囵吞枣", "醉生梦死", "花天酒地",
                    "欢欣鼓舞", "欢天喜地", "绘声绘色", "有声有色", "魂不附体",
                    "失魂落魄", "饥寒交迫", "啼饥号寒", "奄奄一息", "岌岌可危",
                    "历历在目", "记忆犹新", "家常便饭", "习以为常", "出生入死",
                    "赴汤蹈火", "面目一新", "面目全非", "功亏一篑", "前功尽弃",
                    "钩心斗角", "尔虞我诈", "苟且偷安", "苟且偷生", "坚如磐石",
                    "固若金汤", "坚不可摧", "冠冕堂皇", "堂而皇之", "海市蜃楼",
                    "空中楼阁", "忍气吞声", "忍辱含垢", "和颜悦色", "和蔼可亲",
                    "齐心协力", "和衷共济", "赫赫有名", "鼎鼎大名", "络绎不绝",
                    "川流不息", "纷至沓来", "眉开眼笑", "眉飞色舞", "名不虚传",
                    "名副其实", "明目张胆", "明火执仗", "明哲保身", "洁身自好",
                    "目不斜视", "目不转睛", "目空一切", "旁若无人", "背道而驰",
                    "南辕北辙", "念念有词", "振振有词", "大发雷霆", "怒不可遏",
                    "排山倒海", "翻江倒海", "蚍蜉撼树", "螳臂挡车", "锲而不舍",
                    "坚持不懈", "见机行事", "见风使舵", "窃窃私语", "交头接耳",
                    "撼天动地", "惊天动地", "开诚布公", "推心置腹", "推诚相见",
                    "夸夸其谈", "侃侃而谈", "刻不容缓", "迫不及待", "语重心长",
                    "苦口婆心", "脍炙人口", "喜闻乐见", "屈指可数", "寥寥可数",
                    "无稽之谈", "流言蜚语", "乱七八糟", "污七八糟", "燃眉之急",
                    "手忙脚乱", "七手八脚", "进退两难", "进退无门", "杞人忧天",
                    "庸人自扰", "气吞山河", "气势磅礴", "威风凛凛", "气势汹汹",
                    "想方设法", "千方百计", "前车可鉴", "前车之鉴", "敲诈勒索",
                    "巧取豪夺", "聚精会神", "全神贯注", "一心一意", "全心全意",
                    "煞费苦心", "挖空心思", "本末倒置", "舍本逐末", "深谋远虑",
                    "深思熟虑", "神采奕奕", "神采飞扬", "生气勃勃", "生机勃勃",
                    "龙腾虎跃", "生龙活虎", "盛气凌人", "咄咄逼人", "手无寸铁",
                    "赤手空拳", "束手无策", "手足无措", "视若无睹", "熟视无睹",
                    "置之不理", "束之高阁", "因势利导", "顺水推舟", "耸人听闻",
                    "骇人听闻", "随波逐流", "同流合污", "悠然自得", "泰然自若",
                    "忐忑不安", "七上八下", "头头是道", "天花乱坠", "天经地义",
                    "理所当然", "截然不同", "天渊之别", "逼上梁山", "铤而走险",
                    "鸦雀无声", "万籁俱寂", "混为一谈", "相提并论", "外强中干",
                    "色厉内荏", "万无一失", "十拿九稳", "妄自菲薄", "自暴自弃",
                    "微乎其微", "微不足道", "为所欲为", "随心所欲", "有备无患",
                    "未雨绸缪", "瓮中捉鳖", "瓮中之鳖", "无所不为", "无微不至",
                    "无穷无尽", "无边无际", "五颜六色", "五彩缤纷", "五光十色",
                    "五花八门", "五体投地", "心悦诚服", "喜笑颜开", "嬉皮笑脸",
                    "脱胎换骨", "洗心革面", "笑容可掬", "喜形于色", "想入非非",
                    "卓尔不群", "异想天开", "出类拔萃", "与众不同", "鹤立鸡群"
                ]
            },
            {
                "name": "对象误用",
                "words": [
                    "豆蔻年华", "美轮美奂", "相敬如宾", "破镜重圆", "琴瑟之好",
                    "青梅竹马", "休戚相关", "置若罔闻", "筚路蓝缕", "汗牛充栋",
                    "耳提面命", "三令五申", "络绎不绝", "挥洒自如", "豁然开朗",
                    "不可磨灭", "人老珠黄", "巧夺天工", "循序渐进", "如履薄冰",
                    "行云流水", "擢发难数", "一挥而就", "比翼双飞", "脍炙人口",
                    "两小无猜", "乱点鸳鸯", "江郎才尽", "挥洒自如", "呼之欲出",
                    "信手拈来", "鸿篇巨制", "勾画了了", "烘云托月", "韦编三绝",
                    "纵横捭阖", "含英咀华", "洛阳纸贵", "日理万机", "耳鬓厮磨"
                ]
            },
            {
                "name": "多义成语",
                "words": [
                    "龙飞凤舞", "左右逢源", "平铺直叙", "水落石出", "东涂西抹",
                    "海阔天空", "粗枝大叶", "肝脑涂地", "一针见血", "不三不四",
                    "指手画脚", "光怪陆离", "百花齐放", "乘风破浪", "垂涎三尺",
                    "不绝如缕", "步步为营", "老气横秋", "瞻前顾后", "金玉满堂",
                    "春风得意", "平易近人", "洋洋洒洒", "处之泰然", "目无全牛",
                    "守株待兔", "按部就班", "玲珑剔透", "秀色可餐", "眉来眼去",
                    "战战兢兢", "朝秦暮楚", "万紫千红", "灯红酒绿"
                ]
            },
            {
                "name": "谦敬误用",
                "words": [
                    "蓬荜生辉", "敝帚自珍", "抛砖引玉", "贻笑大方", "无功受禄",
                    "敬谢不敏", "恭列门墙", "信笔涂鸦", "一孔之见", "才疏学浅",
                    "德薄才疏", "德薄能鲜", "挂一漏万", "不情之请", "姑妄言之",
                    "笨鸟先飞", "一枝之栖", "恭敬\n不如从命", "望尘莫及", "一得之愚",
                    "尸位素餐", "不足挂齿", "雕虫小技", "绠短汲深", "东涂西抹",
                    "区区此心", "愚者千虑\n必有一得", "管窥蠡测", "班门弄斧", "聊表寸心",
                    "虚左以待", "避让贤路", "高抬贵手", "不吝赐教", "鼎力相助",
                    "洗耳恭听", "高朋满座", "大材小用", "率先垂范", "虚怀若谷"
                ]
            },
            {
                "name": "望文生义",
                "words": [
                    "明日黄花", "火中取栗", "万人空巷", "不刊之论", "不为已甚",
                    "如虎添翼", "不足为训", "因人成事", "登峰造极", "久假不归",
                    "司马青衫", "数典忘祖", "大动干戈", "高山流水", "不绝如缕",
                    "不翼而飞", "秦晋之好", "目无全牛", "守株待兔", "庆父不死\n鲁难未已",
                    "四面楚歌", "卧薪尝胆", "巧言令色", "倚马可待", "破镜重圆",
                    "不可救药", "望洋兴叹", "乐不思蜀", "弹冠相庆", "祸起萧墙",
                    "邯郸学步", "风声鹤唳\n草木皆兵", "按部就班", "苦心孤诣", "高谈阔论",
                    "不绝如缕", "想入非非", "短小精悍", "淋漓尽致", "左右逢源",
                    "信笔涂鸦", "玲珑剔透", "标新立异"
                ]
            },
            {
                "name": "修饰不当",
                "words": [
                    "民不聊生", "哀鸿遍野", "生灵涂炭", "通宵达旦", "漫山遍野",
                    "声如洪钟", "日臻完善", "不言而喻", "莘莘学子", "蓬荜生辉",
                    "生猛海鲜", "当务之急", "妄自菲薄", "忍俊不禁", "难言之隐",
                    "南柯一梦", "相形见绌", "如芒在背", "遍体鳞伤", "当务之急",
                    "接踵而至", "津津乐道", "闻名遐迩", "责无旁贷", "生灵涂炭",
                    "安居乐业", "贻笑大方", "自惭形秽", "莘莘学子", "扪心自问",
                    "真知灼见", "满腹经纶", "众所周知", "妄自菲薄", "不虞之誉",
                    "日理万机", "无地自容", "恍然大悟", "任重道远", "眼花缭乱",
                    "破天荒", "方兴未艾", "芸芸众生", "耿耿于怀", "感激涕零",
                    "历历在目", "刻骨铭心"
                ]
            },
            {
                "name": "用法错误",
                "words": [
                    "津津乐道", "求全责备", "司空见惯", "同日而语", "漠不关心",
                    "相提并论", "一概而论", "等闲视之", "善罢罢休", "等量齐观",
                    "五体投地", "神通广大", "万应灵丹", "吹灰之力", "望其项背",
                    "衣冠楚楚", "寿终正寝", "洗耳恭听", "沐猴而冠", "冠冕堂皇",
                    "乌呼哀哉", "一命呜呼", "望其项背", "善罢罢休", "同日而语",
                    "等量齐观", "一概而论", "等闲视之", "进退维谷", "如坐春风",
                    "春风化雨", "间不容发", "祸起萧墙", "盲人瞎马", "独步天下",
                    "炙手可热", "一衣带水", "下车伊始", "开门见山", "水清无鱼",
                    "力挽狂澜", "相濡以沫", "名不虚传", "耳濡目染", "不可开交",
                    "龙飞凤舞", "左右逢源"
                ]
            },
            {
                "name": "语境不合",
                "words": [
                    "津津乐道", "求全责备", "司空见惯", "同日而语", "漠不关心",
                    "相提并论", "一概而论", "等闲视之", "善罢罢休", "等量齐观",
                    "五体投地", "神通广大", "万应灵丹", "吹灰之力", "望其项背",
                    "衣冠楚楚", "寿终正寝", "洗耳恭听", "沐猴而冠", "冠冕堂皇",
                    "乌呼哀哉", "一命呜呼", "望其项背", "善罢罢休", "同日而语",
                    "等量齐观", "一概而论", "等闲视之", "进退维谷", "如坐春风",
                    "春风化雨", "间不容发", "祸起萧墙", "盲人瞎马", "独步天下",
                    "炙手可热", "一衣带水", "下车伊始", "开门见山", "水清无鱼",
                    "力挽狂澜", "相濡以沫", "名不虚传", "耳濡目染", "不可开交",
                    "龙飞凤舞", "左右逢源"
                ]
            },
            {
                "name": "只见一字",
                "words": [
                    "津津乐道", "求全责备", "司空见惯", "同日而语", "漠不关心",
                    "相提并论", "一概而论", "等闲视之", "善罢罢休", "等量齐观",
                    "五体投地", "神通广大", "万应灵丹", "吹灰之力", "望其项背",
                    "衣冠楚楚", "寿终正寝", "洗耳恭听", "沐猴而冠", "冠冕堂皇",
                    "乌呼哀哉", "一命呜呼", "望其项背", "善罢罢休", "同日而语",
                    "等量齐观", "一概而论", "等闲视之", "进退维谷", "如坐春风",
                    "春风化雨", "间不容发", "祸起萧墙", "盲人瞎马", "独步天下",
                    "炙手可热", "一衣带水", "下车伊始", "开门见山", "水清无鱼",
                    "力挽狂澜", "相濡以沫", "名不虚传", "耳濡目染", "不可开交",
                    "龙飞凤舞", "左右逢源"
                ]
            }
        ]
    }
    jsonData = jsonDataOrigin['data']
    sql = 'create table WordsList(Name text);'
    cur.execute(sql)
    for i in jsonData:
        sql = 'create table if not exists ' + i['name'] + ' (Words text);'
        cur.execute(sql)
        print(i['name'])
        sql = '''insert into WordsList (Name) values ('%s');''' % (i['name'])
        print(sql)
        cur.execute(sql)
        for j in i['words']:
            sql = 'insert into ' + i['name'] + ' (words) values(\'' + j + '\');'
            cur.execute(sql)
    conn.commit()
    conn.close()